# ReferenceViewerUiTargetView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ReferenceViewerUiTargetView Property
ParameterTypeId Class See Also
---
"Target view": This is used by the UI to allow selection of target view. It allows the UI to set a filter that is incompatible with the current target view (REFERENCE_VIEWER_TARGET_VIEW).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ReferenceViewerUiTargetView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReferenceViewerUiTargetView As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ReferenceViewerUiTargetView {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace